beer_api/app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @beers = Beer.all.reverse

INSERT INTO "beers" ("name", "img", "alcohol", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["img", ""], ["alcohol", ""], ["created_at", "2019-12-13 20:15:06.610757"], ["updated_at", "2019-12-13 20:15:06.610757"]]
---
  def create
    @beer = Beer.new(beer_params)

    if @beer.save

UPDATE "beers" SET "name" = $1, "img" = $2, "alcohol" = $3, "updated_at" = $4 WHERE "beers"."id" = $5  [["name", ""], ["img", ""], ["alcohol", ""], ["updated_at", "2019-12-13 16:25:31.863278"], ["id", 11]]
---
  def update
    if @beer.update(beer_params)